ЕСКД/src/Documents/mega_ПроизводственнаяОперацияСводная/mega_ПроизводственнаяОперацияСводная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>mega_ПроизводственнаяОперацияСводная</name>
  <basedOn>Document.mega_СменноеЗадание</basedOn>
  <registerRecords>AccumulationRegister.mega_ПроизводственныеЗапасы</registerRecords>
  <registerRecords>AccumulationRegister.mega_ВыработкаИсполнителей</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СменноеЗадание</name>
    <type>
      <types>DocumentRef.mega_СменноеЗадание</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТехнологическиеОперации</name>
    <attributes>
      <name>ТехнологическаяОперация</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехнологическаяОперацияКоличество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехнологическаяОперацияЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехнологическаяОперацияВремяВыполнения</name>
      <type>
        <types>DefinedType.mega_ВремяВСекундах</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.mega_Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущийВидСтадииОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтадииОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыОпераций</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.mega_Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.mega_Спецификации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕСКД/src/AccumulationRegisters/mega_ПроизводственныеЗапасы/mega_ПроизводственныеЗапасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>mega_ПроизводственныеЗапасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.mega_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтадииОбработки</name>
    <type>
      <types>CatalogRef.mega_ВидыСтадийОбработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.mega_Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕСКД/src/AccumulationRegisters/mega_ВыработкаИсполнителей/mega_ВыработкаИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>mega_ВыработкаИсполнителей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Время</name>
    <type>
      <types>DefinedType.mega_ВремяВСекундах</types>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехнологическаяОперация</name>
    <type>
      <types>CatalogRef.mega_Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕСКД/src/Catalogs/mega_Спецификации/mega_Спецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_Спецификации</name>
  <basedOn>Catalog.mega_ШаблоныСпецификаций</basedOn>
  <owners>Catalog.mega_Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтадииОбработки</name>
    <attributes>
      <name>ВидСтадииОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.mega_Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическиеОперации</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>DefinedType.mega_ВремяВСекундах</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЕСКД/src/Documents/mega_ПроизводственнаяОперацияСводная/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Заполняет "Материалы спецификаций" и "Материалы" по данным спецификаций операций
Процедура ЗаполнитьМатериалы() Экспорт 
	
	Спецификации = ПолучитьСпецификацииДокумента();	
	МатериалыСпецификаций = ПолучитьМатериалыСпецификаций(Спецификации);	
	
	Для Каждого ТекСтрокаТехнологическиеОперации Из ТехнологическиеОперации Цикл
		
		Если ЗначениеЗаполнено(ТекСтрокаТехнологическиеОперации.Спецификация) И 
			ЗначениеЗаполнено(ТекСтрокаТехнологическиеОперации.ВидСтадииОбработки) Тогда
			
			СтадияОбработкиПоВидуСтадииОбработки = 
				Справочники.mega_Спецификации.ПолучитьСтадиюОбработкиПоВидуСтадииОбработки(ТекСтрокаТехнологическиеОперации.Спецификация,
					ТекСтрокаТехнологическиеОперации.ВидСтадииОбработки);
			
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("Спецификация", ТекСтрокаТехнологическиеОперации.Спецификация);
			ПараметрыПоиска.Вставить("КлючСвязи", СтадияОбработкиПоВидуСтадииОбработки.КлючСвязи);
			
			МатериалыСпецификаций.Сбросить();
			Пока МатериалыСпецификаций.НайтиСледующий(ПараметрыПоиска) Цикл
				
				НоваяСтрока = МатериалыОпераций.Добавить();
				НоваяСтрока.КлючСвязи = ТекСтрокаТехнологическиеОперации.КлючСвязи;
				НоваяСтрока.Номенклатура = МатериалыСпецификаций.Материал;
				НоваяСтрока.ЕдиницаИзмерения = МатериалыСпецификаций.ЕдиницаИзмерения;
				НоваяСтрока.Количество = МатериалыСпецификаций.Количество * ТекСтрокаТехнологическиеОперации.Количество;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьМатериалыПоМатериаламОпераций();
КонецПроцедуры //ЗаполнитьМатериалы

#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    	
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр mega_ПроизводственныеЗапасы Приход	
	Движения.mega_ПроизводственныеЗапасы.Записывать = Истина;
	Движения.mega_ВыработкаИсполнителей.Записывать = Истина;
	
	Для Каждого ТекСтрока Из ТехнологическиеОперации Цикл
		
		//Запасы
		Движение = Движения.mega_ПроизводственныеЗапасы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрока.Номенклатура;
		Движение.ВидСтадииОбработки = ТекСтрока.ВидСтадииОбработки;
		Движение.Количество = ТекСтрока.Количество;
		
		Если ЗначениеЗаполнено(ТекСтрока.ПредыдущийВидСтадииОбработки) Тогда 
			
			Движение = Движения.mega_ПроизводственныеЗапасы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрока.Номенклатура;
			Движение.ВидСтадииОбработки = ТекСтрока.ПредыдущийВидСтадииОбработки;
			Движение.Количество = ТекСтрока.Количество;		
		КонецЕсли;
		
		//Работы
		Движение = Движения.mega_ВыработкаИсполнителей.Добавить();		
		Движение.Период = Дата;
		Движение.Исполнитель = ТекСтрока.Ответственный;
		Движение.ТехнологическаяОперация = ТекСтрока.ТехнологическаяОперация;
		Движение.Количество = ТекСтрока.ТехнологическаяОперацияКоличество;
		Движение.Время = ТекСтрока.ТехнологическаяОперацияВремяВыполнения;
	КонецЦикла;
		
	//Материалы
	Для Каждого ТекСтрока Из Материалы Цикл 
		
		Движение = Движения.mega_ПроизводственныеЗапасы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрока.Номенклатура;		
		Движение.Количество = ТекСтрока.Количество;
	КонецЦикла;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


// Возвращает массив уникальных спецификаций операций документа
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.mega_Спецификации
Функция ПолучитьСпецификацииДокумента()
	
	ВременныеТехнологическиеОперации = ТехнологическиеОперации.Выгрузить();
	ВременныеТехнологическиеОперации.Свернуть("Спецификация");
	Возврат ВременныеТехнологическиеОперации.ВыгрузитьКолонку("Спецификация");
КонецФункции //ПолучитьСпецификацииДокумента()


// Сворачивает "Материалы операций" и загружает данные в "Материалы"
Процедура ЗаполнитьМатериалыПоМатериаламОпераций()
	
	ВремМатериалыОпераций = МатериалыОпераций.Выгрузить();
	ВремМатериалыОпераций.Свернуть("Номенклатура,ЕдиницаИзмерения,Спецификация", "Количество");
	Материалы.Загрузить(ВремМатериалыОпераций);
КонецПроцедуры //ЗаполнитьМатериалыПоМатериаламОпераций


// Получить материалы спецификаций.
// 
// Параметры:
//  Спецификации - Массив Из СправочникСсылка.mega_Спецификации
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - Получить материалы спецификаций
Функция ПолучитьМатериалыСпецификаций(Спецификации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МатериалыСпецификаций.Ссылка КАК Спецификация,
		|	МатериалыСпецификаций.Номенклатура КАК Материал,
		|	МатериалыСпецификаций.Количество / МатериалыСпецификаций.Ссылка.Количество КАК Количество,
		|	МатериалыСпецификаций.ЕдиницаИзмерения,
		|	МатериалыСпецификаций.СтадияОбработки,
		|	МатериалыСпецификаций.КлючСвязи
		|ИЗ
		|	Справочник.mega_Спецификации.Материалы КАК МатериалыСпецификаций
		|ГДЕ
		|	МатериалыСпецификаций.Ссылка В (&Спецификации)";
	
	Запрос.УстановитьПараметр("Спецификации", Спецификации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции //ПолучитьМатериалыСпецификаций

Процедура ЗаполнитьТехнологическиеОперации()
	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
